Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/standards_and_accountability/unconstitutional_legislation_and_decisions.html.txt.tmx
Source language: en
Languages: ga

source: Under Article 15 of the Constitution of Ireland, the Oireachtas must not enact a law which is incompatible with the Constitution
ga: Tá foráil in Airteagal 15 de Bhunreacht na hÉireann nach n-achtóidh an tOireachtas aon dlí nach bhfuil ag luí leis an mBunreacht

source: Also, if a law or part of a law is incompatible with the Constitution, the law or part of it is invalid
ga: Lena chois sin, más rud é nach bhfuil dlí nó cuid de dhlí ag luí leis an mBunreacht tá an dlí sin nó cuid de neamhbhailí

source: A law passed by the Oireachtas is presumed to be constitutional until it is proven not to be
ga: Glactar leis go bhfuil dlí a ritheann an tOireachtas ag luí leis an mBunreacht go dtí go gcruthaítear a mhalairt

source: Legislation starts life as a Bill which is passed by both Houses of the Oireachtas
ga: Is mar bhillí a ritheann dhá theach an Oireachtais (Parlaimint na hÉireann) a chuirtear tús le Reachtaíocht

source: Every Bill must be signed by the Irish President before it can become law
ga: Ní mór d’Uachtarán na hÉireann gach bille a shíniú sula mbíonn sé ina dhlí in Éirinn

source: As soon as a Bill has been passed by both Houses of the Oireachtas, it is presented to the President for signature
ga: Nuair a ritheann dhá Theach an Oireachtas bille cuirtear faoi bhráid an Uachtaráin é lena shíniú

source: Before signing the Bill, the President has the power under Article 26 of the Constitution to refer the bill to the Supreme Court when there is doubt as to whether it is constitutional
ga: Má tá amhras ann nach bhfuil bille ag luí leis an mBunreacht tá sé de chumhacht ag an Uachtarán de bhun Airteagal 26 an Bhunreachta an bille a chur ar aghaidh go dtí an Chúirt Uachtarach sula síníonn sé nó sí é

source: The President must first consult with the Council of State but the decision to refer the Bill is the President's alone
ga: Caithfidh an tUachtarán dul i gcomhairle leis an gComhairle Stáit ar dtús ach is é an tUachtarán féin a dhéanann an cinneadh faoin mbille a chur ar aghaidh

source: The Supreme Court must decide whether or not the Bill conflicts with the Constitution
ga: Ní mór don Chúirt Uachtarach cinneadh a dhéanamh an luíonn an bille leis an mBunreacht nó nach luíonn

source: If the Supreme Court holds that the Bill is unconstitutional, the President cannot sign it into law
ga: Má chinneann an Chúirt Uachtarach go bhfuil an bille míbhunreachtúil ní féidir leis an Uachtarán é a shíniú le dlí a dhéanamh de

source: Under Article 34 of the Constitution, if a Bill has been referred by the President and the Supreme Court decides that the Bill is compatible with the Constitution, the constitutionality of this legislation cannot be challenged subsequently
ga: Faoin Airteagal 34 Bunreacht, má chuirtear an Bille ar aghaidh ag an Uachtarán, agus cinneann an Chúirt Uachtarach go bhfuil an Bille ag luí leis an mBunreacht, ní féidir dúshlán faoi bhunreachtúlacht na reachtaíochta seo a chur

source: The High Court has the power or jurisdiction to cancel any law or part of any law that is repugnant to the Constitution
ga: Tá sé de chumhacht nó de “dhlínse” ag an Ard-Chúirt aon dlí nó cuid de dhlí nach bhfuil ag luí leis an mBunreacht a chur ar ceal

source: This means that if you believe that a law breaches the Constitution or your fundamental rights, you may bring proceedings in the High Court
ga: Ciallaíonn sé sin gur féidir imeachtaí a thionscnamh san Ard-Chúirt má chreideann tú go sáraíonn dlí an Bunreacht nó go sáraíonn sé do chearta bunúsacha

source: The constitutionality of an Act that has not yet commenced may be challenged where an order commencing it could be made at any time
ga: Féadfar dúshlán a thabhairt d’Acht nár tugadh feidhm fós dó más rud é gur féidir ordú a dhéanamh uair ar bith le feidhm a thabhairt dó

source: Notice of the proceedings must be served on the Attorney General
ga: Caithfear fógra faoi na himeachtaí a sheirbheáil ar an Ard-Aighne

source: In order to challenge the constitutionality of legislation, you must show that you have "sufficient interest" in the proceedings, that is, that the legislation affects you in some real way
ga: Má tá tú chun dúshlán na reachtaíochta a thabhairt ar an ábhar nach luíonn sí leis an mBunreacht ní mór duit a léiriú go bhfuil “dóthain leasa” agat sna himeachtaí, .i

source: You must also show that you have an arguable case, that is, that your case has grounds
ga: go bhfuil tionchar ag an reachtaíocht ort ar bhealach éigin

source: The High Court will examine the legislation in question and decide whether or not it conflicts with the Constitution
ga: Déanfaidh an Ard-Chúirt an reachtaíocht atá i gceist a scrúdú agus tabharfaidh sí breith an luíonn sí leis an mBunreacht nó nach luíonn

source: If it decides that the legislation does conflict with the Constitution, it may annul or cancel the law or the part of it that is unconstitutional
ga: Má chinneann sí nach bhfuil an reachtaíocht ag luí leis an mBunreacht féadfaidh sí an dlí nó an chuid de nach bhfuil ag luí leis an mBunreacht a neamhniú nó a chealú

source: The High Court’s decision may be appealed to the Supreme Court
ga: Féadfar achomharc a dhéanamh chun na Cúirte Uachtaraí faoi chinneadh na hArd-Chúirte

source: If you wish to begin judicial proceedings, you should contact a solicitor who will in turn brief a barrister to draft the papers for the case
ga: Más mian leat imeachtaí breithiúnacha a thionscnamh, ba chóir duit teagmháil a dhéanamh le haturnae a chuirfidh mionteagasc ar a uain chuig abhcóide chun páipéir a ullmhú don chás

source: It is also possible for you to represent yourself if you wish to keep your legal costs down
ga: Is féidir leat ionadaíocht a dhéanamh ort féin freisin más mian leat do chostais dlí a choinneáil íseal

source: There is no fixed rate of charges for legal fees so you should obtain some quotes before deciding on legal representation
ga: Níl aon ráta seasta muirear ann le haghaidh táillí dlí agus mar sin ba cheart duit roinnt meastachán a fháil sula gcinneann tú ionadaíocht dlí a fháil

source: Your solicitor must advise you in writing of the fees you will be charged for their services
ga: Ní mór do d’aturnae tú a chur ar an eolas i scríbhinn faoi na táillí a ghearrfar ort as a c(h)uid seirbhísí

source: If it is not possible to give you a definite sum, they must estimate a sum or at the very least describe the basis upon which charges or fees will be calculated
ga: Murar féidir suim chinnte a thabhairt duit, ní mór dó/di an tsuim a mheas nó ar a laghad cur síos a dhéanamh ar an mbunús a ndéanfar muirir nó táillí a ríomh air
